rc.org
#+TITLE: rc.org
#+PROPERTY: header-args :comments link :mkdirp yes :results silent

* Intro

This is where I keep the bulk of my dotfiles (that aren't emacs or zsh). If it
seems like a bit of a mess to keep it all in one place, note that this is /much/
more readable in org format than in rendered markdown.

* Contents                                                              :toc:
- [[#intro][Intro]]
- [[#config][Config]]
  - [[#profile][profile]]
  - [[#cookiecutterrc][cookiecutterrc]]
  - [[#cvimrc][cvimrc]]
  - [[#darktooththeme-cmus][darktooth.theme (cmus)]]
  - [[#emacsclientdesktop][emacsclient.desktop]]
  - [[#git][git]]
  - [[#i3][i3]]
  - [[#khdrc][khdrc]]
  - [[#kwmrc][kwmrc]]
  - [[#nanorc][nanorc]]
  - [[#networkmanager_dmenu][networkmanager_dmenu]]
  - [[#peco][peco]]
  - [[#pythonrcpy][pythonrc.py]]
  - [[#rainbowstream][rainbowstream]]
  - [[#ssh][ssh]]
  - [[#termite][termite]]
  - [[#tmux][tmux]]
  - [[#xresources][Xresources]]
  - [[#zathurarc][zathurarc]]
- [[#scripts][Scripts]]
  - [[#dropmite][dropmite]]
  - [[#ev][ev]]
  - [[#i3blocks][i3blocks]]
  - [[#masterinstall][masterinstall]]
  - [[#mbuild][mbuild]]
  - [[#ocrpdf][ocrpdf]]
  - [[#ocrpdf2][ocrpdf2]]
  - [[#org-tangle][org-tangle]]
  - [[#pass][pass]]
  - [[#pixelate][pixelate]]
  - [[#playerctl-cmus][playerctl-cmus]]
  - [[#spectrum_ls][spectrum_ls]]
  - [[#spotify][spotify]]
  - [[#text-pager][text-pager]]
  - [[#updates][updates]]
  - [[#wfname][wfname]]
  - [[#rofi-files][rofi-files]]
- [[#local-vars][Local vars]]

* Config
** profile
:PROPERTIES:
:header-args+: :tangle ~/.profile
:END:
I'm not even sure why this bit is here, to be honest.
#+begin_src sh
# if running bash
if [ -n "$BASH_VERSION" ]; then
    # include .bashrc if it exists
    if [ -f "$HOME/.bashrc" ]; then
	. "$HOME/.bashrc"
    fi
fi
#+end_src
** cookiecutterrc
:PROPERTIES:
:header-args+: :tangle ~/.cookiecutterrc
:END:
Config for [[https://github.com/audreyr/cookiecutter][cookiecutter]].
#+begin_src conf
# -*- mode: conf -*-
default_context:
    full_name: "Diego A. Mundo"
    email: "diegoamundo@protonmail.com"
    github_username: "therockmandolinist"
    bundle_id_root: "com.therockmandolinist"
cookiecutters_dir: "~/.cookiecutters/"
#+end_src
** cvimrc
:PROPERTIES:
:header-args+: :tangle ~/.cvimrc :comments no
:END:
Config for [[https://github.com/1995eaton/chromium-vim][cvim]].
#+begin_src vimrc
let configpath='/Users/diego/.cvimrc'
set localconfig
set smoothscroll
set noautofocus

let defaultengine = "duckduckgo"
let hintcharacters = "aoeuidhtns"
let homedirectory = "/Users/diego"
let searchlimit = 9

let blacklists = ['*://inbox.google.com/*']

map J nextTab
map K previousTab
#+end_src
** darktooth.theme (cmus)
:PROPERTIES:
:header-args+: :tangle ~/.config/cmus/darktooth.theme
:END:
A theme for cmus based on [[https://github.com/emacsfodder/emacs-theme-darktooth][darktooth]].
#+begin_src conf
# Directory colors
set color_win_dir=108

# Normal text
set color_win_fg=default

# Window background color.
set color_win_bg=0

# Command line color.
set color_cmdline_bg=0
set color_cmdline_fg=6

# Color of error messages displayed on the command line.
set color_error=lightred

# Color of informational messages displayed on the command line.
set color_info=lightgreen

# Color of the separator line between windows in view (1).
set color_separator=246

# Color of window titles (topmost line of the screen).
set color_win_title_bg=234
set color_win_title_fg=12

# Status line color (shows remaining time and playback options).
set color_statusline_bg=0
set color_statusline_fg=10

# Color of currently playing track.
set color_win_cur=009

# Color of the line displaying currently playing track.
set color_titleline_bg=234
set color_titleline_fg=12

# Color of the selected row which is also the currently playing track in active window.
set color_win_cur_sel_bg=237
set color_win_cur_sel_fg=9

# Color of the selected row which is also the currently playing track in inactive window.
set color_win_inactive_cur_sel_bg=236
set color_win_inactive_cur_sel_fg=9

# Color of selected row in active window.
set color_win_sel_bg=237
set color_win_sel_fg=default

# Color of selected row in inactive window.
set color_win_inactive_sel_bg=236
set color_win_inactive_sel_fg=default
#+end_src
** emacsclient.desktop
:PROPERTIES:
:header-args+: :tangle (when (eq system-type 'gnu/linux)  "~/.local/share/applications/emacsclient.desktop")
:END:
This lets you set emacsclient as the default application for things. Kinda nifty.
#+begin_src conf
[Desktop Entry]
Name=Emacs Client
Exec=emacsclient -n %u
Icon=emacs-icon
Type=Application
Terminal=false
#+end_src
** git
*** gitconfig
:PROPERTIES:
:header-args+: :tangle ~/.gitconfig
:END:
I know, it probably doesn't make sense to keep my gitconfig here.
**** media
#+begin_src conf
[filter "media"]
    required = true
    clean = git media clean %f
    smudge = git media smudge %f
#+end_src
**** user
#+begin_src conf
[user]
    name = therockmandolinist
    email = diegoamundo@protonmail.com
    signingkey = AEAC5CE8E1F933F0
#+end_src
**** filter
#+begin_src conf
[filter "lfs"]
    clean = git-lfs clean %f
    smudge = git-lfs smudge %f
    required = true
#+end_src
**** core
#+begin_src conf
[core]
    editor = emacsclient -t
    excludesfile = ~/.gitignore
    pager = "less"
#+end_src
**** credential
#+begin_src conf
[credential]
    helper = /usr/local/bin/pass-git-helper
#+end_src
**** gpg
#+begin_src conf
[gpg]
    program = gpg2
#+end_src
**** alias
#+begin_src conf
[alias]
    eclipse = !git fetch upstream && git rebase -s recursive -X theirs upstream/master
    gconfig = config --global
    lconfig = config --local
    mypull = pull -s recursive -X ours
    myrebase = rebase -s recursive -X theirs
    optimize = "!f() { git reflog expire --all --expire=now && git gc --prune=now --aggressive; }; f"
    plog = log --graph --pretty=format:'%C(bold black)%h%Creset - %<(50,trunc)%C(bold normal)%s%Creset %<(20)%C(bold green)%an%Creset %<(15)%C(bold red)%cr%Creset%C(bold yellow)%d%Creset' --abbrev-commit
    plog-nocolor = log --graph --pretty=format:'%h - %<(50,trunc)%s %<(20)%an %<(15)%cr%d' --abbrev-commit
    update-from-upstream = pull --rebase -s recursive -X theirs upstream/master
    aliases = config --get-regexp '^alias\\.'
    a = add
    s = status
    sl = status --long
    c = checkout
    cb = checkout -b
    b = branch
    r = rebase
    p = pull
    pr = pull --rebase
    ps = push
    psf = push --force
#+end_src
**** http
#+begin_src conf
[http]
    postBuffer = 524288000
#+end_src
**** color
#+begin_src conf
[color]
    ui = auto
[color "status"]
    added = green bold
    changed = red bold
    untracked = red bold
[color "branch"]
    current = green bold
    remote = magenta bold
[color "diff"]
    new = green bold
    old = red bold
#+end_src
**** http
#+begin_src conf
[push]
    followTags = true
#+end_src
**** status
#+begin_src conf
[status]
    showUntrackedFiles = all
    short=true
    branch=true
#+end_src
**** commit
#+begin_src conf
[commit]
    gpgsign = true
#+end_src
**** push
#+begin_src conf
[push]
    followTags = true
#+end_src
*** gitignore
:PROPERTIES:
:header-args+: :tangle ~/.gitignore
:END:

#+begin_src conf
.DS\_Store
*.pyc
__pychache__
*.alfredworkflow
#+end_src
** i3
*** i3wm
:PROPERTIES:
:header-args+: :tangle (when (eq system-type 'gnu/linux) "~/.config/i3/config")
:END:
**** Defaults
#+begin_src conf
# Set modifier key to command/windows key
set $mod Mod4

# Font for window titles. Will also be used by the bar unless a different font
# is used in the bar {} block below.
font pango:Iosevka Term 8.5

# Use Mouse+$mod to drag floating windows to their wanted position
floating_modifier $mod

# reload the configuration file
bindsym $mod+Shift+j reload

# reload X11
bindsym $mod+Shift+x exec xrdb -merge ~/.Xresources

# restart i3 inplace (preserves your layout/session, can be used to upgrade i3)
bindsym $mod+Shift+p restart

# exit i3 (logs you out of your X session)
bindsym $mod+Shift+period exec "i3-nagbar -t warning -m 'You pressed the exit shortcut. Do you really want to exit i3? This will end your X session.' -b 'Yes, exit i3' 'i3-msg exit'"
#+end_src
**** Rofi
#+begin_src conf
# kill focused window
bindsym $mod+Shift+apostrophe kill

# start rofi for windows and commands
bindsym Mod1+space exec "rofi -combi-modi window,run -show combi -modi combi"

# pass helper
bindsym $mod+p exec "~/.password-store/.extensions/rofi.bash"

# File finder with ripgrep
bindsym $mod+f exec "~/bin/rofi-files"
#+end_src
**** Scratchpad and floating
#+begin_src conf
# Scratchpad
bindsym $mod+minus move scratchpad
bindsym $mod+shift+minus scratchpad show

# Floating editor
exec --no-startup-id emacs
for_window [title="^emacs@Ragnarok$"] floating enable;
for_window [title="^emacs@Ragnarok$"] move scratchpad; [title="^emacs@Ragnarok$"] scratchpad show; move scratchpad
bindsym $mod+space [title="^emacs@Ragnarok$"] scratchpad show

# Floating terminal
exec --no-startup-id termite --name=dropmite
for_window [instance="dropmite"] floating enable;
for_window [instance="dropmite"] move scratchpad; [instance="dropmite"] scratchpad show; resize set 2446 585; move absolute position 59px 95px; move scratchpad
bindsym $mod+Return [instance="dropmite"] scratchpad show
#+end_src
**** Focus
#+begin_src conf
# change focus
bindsym $mod+h focus left
bindsym $mod+t focus down
bindsym $mod+n focus up
bindsym $mod+s focus right

# alternatively, you can use the cursor keys:
bindsym $mod+Left focus left
bindsym $mod+Down focus down
bindsym $mod+Up focus up
bindsym $mod+Right focus right

# change focus between tiling / floating windows
# bindsym $mod+space focus mode_toggle

# focus the parent container
bindsym $mod+a focus parent

# focus the child container
#bindsym $mod+d focus child
#+end_src
**** Motion
#+begin_src conf
# move focused window
bindsym $mod+Shift+h move left
bindsym $mod+Shift+t move down
bindsym $mod+Shift+n move up
bindsym $mod+Shift+s move right
bindsym $mod+Shift+c move position center

# alternatively, you can use the cursor keys:
bindsym $mod+Shift+Left move left
bindsym $mod+Shift+Down move down
bindsym $mod+Shift+Up move up
bindsym $mod+Shift+Right move right
#+end_src
**** Layout and splitting
#+begin_src conf
# split in horizontal orientation
bindsym $mod+d split h

# split in vertical orientation
bindsym $mod+k split v

# enter fullscreen mode for the focused container
bindsym $mod+u fullscreen toggle

# change container layout (stacked, tabbed, toggle split)
bindsym $mod+o layout stacking
bindsym $mod+comma layout tabbed
bindsym $mod+period layout toggle split

# toggle tiling / floating
bindsym $mod+Shift+space floating toggle
#+end_src
**** Workspaces
#+begin_src conf
# switch to workspace
workspace_layout tabbed
bindsym $mod+1 workspace 1
bindsym $mod+2 workspace 2
bindsym $mod+3 workspace 3
bindsym $mod+4 workspace 4
bindsym $mod+5 workspace 5
bindsym $mod+6 workspace 6
bindsym $mod+7 workspace 7
bindsym $mod+8 workspace 8
bindsym $mod+9 workspace 9
bindsym $mod+0 workspace 10

# move focused container to workspace
bindsym $mod+Shift+1 move container to workspace 1
bindsym $mod+Shift+2 move container to workspace 2
bindsym $mod+Shift+3 move container to workspace 3
bindsym $mod+Shift+4 move container to workspace 4
bindsym $mod+Shift+5 move container to workspace 5
bindsym $mod+Shift+6 move container to workspace 6
bindsym $mod+Shift+7 move container to workspace 7
bindsym $mod+Shift+8 move container to workspace 8
bindsym $mod+Shift+9 move container to workspace 9
bindsym $mod+Shift+0 move container to workspace 10
#+end_src
**** Resizing
#+begin_src conf
# resize window (you can also use the mouse for that)
mode "resize" {
        # These bindings trigger as soon as you enter the resize mode

        # Pressing left will shrink the window’s width.
        # Pressing right will grow the window’s width.
        # Pressing up will shrink the window’s height.
        # Pressing down will grow the window’s height.
        bindsym h resize shrink width 10 px or 10 ppt
        bindsym t resize grow height 10 px or 10 ppt
        bindsym n resize shrink height 10 px or 10 ppt
        bindsym s resize grow width 10 px or 10 ppt

        # same bindings, but for the arrow keys
        bindsym Left resize shrink width 10 px or 10 ppt
        bindsym Down resize grow height 10 px or 10 ppt
        bindsym Up resize shrink height 10 px or 10 ppt
        bindsym Right resize grow width 10 px or 10 ppt

        # back to normal: Enter or Escape
        bindsym Return mode "default"
        bindsym Escape mode "default"
}

bindsym $mod+r mode "resize"
#+end_src
**** Bar
#+begin_src conf
# Start i3bar to display a workspace bar (plus the system information i3status
# finds out, if available)
bar {
    status_command i3blocks
    position top
    tray_output none
    font pango:Iosevka Term, FontAwesome 8.5
    colors {
        background #282828
        statusline #fdf4c1
        focused_workspace #076678 #076678 #FDF4c1
        active_workspace   #333333 #5f676a #FDF4c1
        inactive_workspace #222222 #222222 #888888
        urgent_workspace   #2f343a #901A1E #FDF4c1
        binding_mode       #2f343a #901A1E #FDF4c1
    }
}
#+end_src
**** Appearance
#+begin_src conf
# class                 border  background text    indicator child_border
client.focused          #EBDBB2 #EBDBB2    #282828 #3fd7e5   #EBDBB2
client.focused_inactive #282828 #282828    #dcdcdc #484e50
client.unfocused        #2D2D2D #282828    #A89984 #292d2e
client.urgent           #2D2D2D #2D2D2D    #dcdcdc #901A1E
client.background       #282828

gaps inner 30
gaps outer 0
new_window 1pixel
#+end_src
**** Bindings
#+begin_src conf
# Keyboard brightness
bindsym XF86KbdBrightnessDown exec kb-light - && pkill -RTMIN+2 i3blocks
bindsym XF86KbdBrightnessUp exec kb-light + && pkill -RTMIN+2 i3blocks

# Screen brightness
bindsym XF86MonBrightnessUp exec xbacklight +2 && pkill -RTMIN+2 i3blocks
bindsym XF86MonBrightnessDown exec xbacklight -2 && pkill -RTMIN+2 i3blocks

# Audio controls
bindsym XF86AudioMute exec amixer -D pulse sset Master toggle && pkill -RTMIN+3 i3blocks
bindsym XF86AudioLowerVolume exec amixer -D pulse sset Master 2%- && pkill -RTMIN+3 i3blocks
bindsym XF86AudioRaiseVolume exec amixer -D pulse sset Master 2%+ && pkill -RTMIN+3 i3blocks

# Media controls
bindsym XF86AudioPrev exec playerctl-cmus previous && pkill -RTMIN+1 i3blocks
bindsym XF86AudioNext exec playerctl-cmus next && pkill -RTMIN+1 i3blocks
bindsym XF86AudioPlay exec playerctl-cmus play-pause && pkill -RTMIN+1 i3blocks

# Screenshot
bindsym --release XF86LaunchB exec "scrot -s ~/Pictures/Screenshots/%Y-%m-%d_%H:%M:%S.png"
bindsym Shift+XF86LaunchB exec "scrot -ub ~/Pictures/Screenshots/%Y-%m-%d_%H:%M:%S.png"
bindsym XF86LaunchA exec "scrot ~/Pictures/Screenshots/%Y-%m-%d_%H:%M:%S.png"
#+end_src
**** Startup Programs/Commands
#+begin_src conf
exec --no-startup-id dropbox start
exec --no-startup-id sh ~/.fehbg
# exec --no-startup-id /home/diego/.ghq/github.com/olemartinorg/i3-alternating-layout/alternating_layouts.py
exec --no-startup-id unclutter
exec --no-startup-id xset s off
exec --no-startup-id xset r rate 300 50
exec --no-startup-id setxkbmap dvorak
exec --no-startup-id setxkbmap -option 'ctrl:nocaps'
exec --no-startup-id xcape -e 'Control_L=Escape'
exec --no-startup-id nm-applet
#+end_src
