rc.org
** org-tangle
:PROPERTIES:
:header-args+: :tangle ~/dotfiles/org-tangle :shebang "#!emacs --script"
:END:
Standalone emacs-lisp script to tangle rc.org, zsh.org, and config.org.
#+begin_src emacs-lisp
(defun dotfiles-file (name)
  (expand-file-name
   (concat
    (substring default-directory
               0
               (+ (string-match "dotfiles/" default-directory) 9))
    name)))

(defun blue-text (text)
  (format "\e[94m%s\e[0m" text))

(defun green-text (text)
  (format "\e[92m%s\e[0m" text))

(defun red-text (text)
  (format "\e[91m%s\e[0m" text))

(let ((specified-files (nthcdr 3 command-line-args))
      (default-files '("rc.org" "zsh.org" "emacs.d/config.org"))
      (confirm-install nil))
  (if (or (= (length specified-files) 0)
          (and (= (length specified-files) 1) (string= (car specified-files) "--ask")))
      (progn
        (when (string= (car specified-files) "--ask")
          (setq confirm-install t))
        (message "Intalling default files: %s"
                 (blue-text
                  (mapconcat 'identity default-files "\e[0m, \e[94m")))
        (if (y-or-n-p "Continue?")
            (progn
              (require 'org)
              (dolist (file default-files)
                (let ((filename (dotfiles-file file))
                      (file-list '()))
                  (if (file-exists-p filename)
                      (progn
                        (message "Found file: %s, installing to:" (green-text file))
                        (find-file filename)
                        (while (search-forward-regexp ":tangle[^~\n]+\\(~/.[^[:space:]\"]+\\)" nil t)
                          (add-to-list 'file-list (match-string 1) t))
                        (dolist (i file-list)
                          (message "    %s" (blue-text i)))
                        (if (or (not confirm-install) (y-or-n-p "Continue?"))
                            (let ((inhibit-message t))
                              (org-babel-tangle-file filename))
                          (message "Skipping...")))
                    (message "File %s not found, skipping..." (red-text filename)))))
              (message "Done!"))
          (messsage "Aborted.")))

    (message "Installing specified files/headings: %s"
             (blue-text (mapconcat 'identity (remove "--ask" specified-files) "\e[0m, \e[94m")))
    (if (y-or-n-p "Continue?")
        (progn
          (require 'org)
          (dolist (file specified-files)
            (if (string= file "--ask")
                (setq confirm-install t)
              (let ((filename (expand-file-name (dotfiles-file file))))
                (if (not (file-exists-p filename))
                    (progn
                      (find-file (dotfiles-file "rc.org"))
                      (if (search-forward-regexp (concat "* " file "$"))
                          (progn
                            (org-narrow-to-subtree)
                            (let ((file-list '()))
                              (while (search-forward-regexp ":tangle[^~\n]+\\(~/.[^[:space:]\"]+\\)" nil t)
                                (add-to-list 'file-list (match-string 1) t))
                              (message "Found heading %s, installing to:" (green-text file))
                              (dolist (i file-list)
                                (message "    %s" (blue-text i))))
                            (let ((inhibit-message t))
                              (if (or (not confirm-install) (y-or-n-p "Continue?"))
                                  (org-babel-tangle)
                                (message "Skipping..."))))
                        (message "File or heading %s doesn't exist, skipping..." (red-text file))))
                  (message "Found file %s, installing to:" (green-text file))
                  (find-file filename)
                  (let ((file-list '()))
                    (while (search-forward-regexp ":tangle[^~\n]+\\(~/.[^[:space:]\"]+\\)" nil t)
                      (add-to-list 'file-list (match-string 1) t))
                    (dolist (i file-list)
                      (message "    %s" (blue-text i))))
                  (if (or (not confirm-install) (y-or-n-p "Continue?"))
                      (let ((inhibit-message t))
                        (org-babel-tangle-file (expand-file-name filename)))
                    (message "Skipping..."))))))
          (message "Done!"))
      (message "Aborted."))))

(message "Symlinking dotfiles/emacs.d to ~/.emacs.d...")
(cond ((string= (file-symlink-p (expand-file-name "~/.emacs.d")) (dotfiles-file "emacs.d/"))
       (message "~/.emacs.d already points to %s" (dotfiles-file ".emacs.d/")))
      ((file-exists-p (expand-file-name "~/.emacs.d"))
       (message "~/.emasc.d exists, not symlinking."))
      (t (make-symbolic-link (dotfiles-file "emacs.d/") (expand-file-name "~/.emacs.d") t)))

(message "Symlinking dotfiles/vim to ~/.vim...")
(cond ((string= (file-symlink-p (expand-file-name "~/.vim")) (dotfiles-file "vim/"))
       (message "~/.vim already points to %s" (dotfiles-file "vim/")))
      ((file-exists-p (expand-file-name "~/.emacs.d"))
       (message "~/.vim exists, not symlinking."))
      (t (make-symbolic-link (dotfiles-file "vim/") (expand-file-name "~/.vim") t)))
(setq argv nil)
#+end_src
** pass
Extensions and utilities for [[https://www.passwordstore.org/][pass]] password manager.
*** pass-peco
:PROPERTIES:
:header-args+: :tangle ~/.password-store/.extensions/peco.bash :shebang "#!/usr/bin/env bash"
:END:
#+begin_src sh
name=$(rg -g "*.gpg" "$HOME/.password-store" --files \
           | sed 's@'"$HOME"'/\.password-store/\(.\+\?\)\.gpg@\1@' \
           | peco --prompt="[pass]")

[[ -n "$name" ]] && pass -c $name
#+end_src
*** pass-rofi
:PROPERTIES:
:header-args+: :tangle (when (eq system-type 'gnu/linux) "~/.password-store/.extensions/rofi.bash") :shebang "#!/usr/bin/env bash"
:END:
#+begin_src sh
name=$(~/.zplug/bin/rg -g "*.gpg" "$HOME/.password-store" --files \
           | sed 's@'"$HOME"'/\.password-store/\(.\+\?\)\.gpg@\1@' \
           | sort \
           | rofi -dmenu -i -p "[pass] ")

pass -c $name
#+end_src
** pixelate
:PROPERTIES:
:header-args+: :tangle ~/bin/pixelate :shebang "#!/usr/bin/env bash"
:END:
#+begin_src sh
AMOUNT=$(echo "1.001 - $1" | bc -l)
INFILE=$2
OUFILE=$3

COEFF1=$(echo "100 * $AMOUNT" | bc -l)
COEFF2=$(echo "100 / $AMOUNT" | bc -l)

convert -scale $COEFF1% -scale $COEFF2% $INFILE $OUFILE
#+end_src
** playerctl-cmus
:PROPERTIES:
:header-args+: :tangle (when (eq system-type 'gnu/linux) "~/bin/playerctl-cmus") :shebang "#!/usr/bin/env bash"
:END:
Wrapper around playerctl to control cmus as well.
#+begin_src sh
other=$(ps axc | grep 'spotify')
if [ ! -z "$other" ]; then
    playerctl $1
else
    if [ "$1" = "play-pause" ]; then
        if [ "$(cmus-remote -Q | grep status)" = "status paused" ]; then
           cmus-remote -p
        elif [ "$(cmus-remote -Q | grep status)" = "status playing" ]; then
            cmus-remote -u
        fi
    elif [ "$1" = "next" ]; then
        cmus-remote -n
    elif [ "$1" = "previous" ]; then
        cmus-remote -r
    fi

fi
#+end_src
** spectrum_ls
:PROPERTIES:
:header-args+: :tangle ~/bin/spectrum_ls :shebang "#!/usr/bin/env zsh"
:END:
Builds on oh-my-zsh's [[https://github.com/robbyrussell/oh-my-zsh/blob/master/lib/spectrum.zsh#L26][spectrum_ls]].
#+begin_src sh
if [ "$#" = 1 ]; then
  code="$(printf "%03d\n" $1)"
  print -P -- "$code: %F{$code}$code%f"
else;
    for code in $(seq -f "%03g" ${1:-000} ${2:-255}); do
        print -P -- "$code: %F{$code}$code%f"
    done
fi
#+end_src
** spotify
:PROPERTIES:
:header-args+:  :tangle (when (eq system-type 'gnu/linux) "~/bin/spotify") :shebang "#!/usr/bin/env bash"
:END:
Wrapper script around ~/usr/bin/spotify~ to fix UI scaling in i3wm.
#+begin_src sh
/usr/bin/spotify --force-device-scale-factor=2 > /dev/null 2>&1 &
#+end_src
** text-pager
:PROPERTIES:
:header-args+: :tangle ~/bin/text-pager :shebang "#!/usr/bin/env bash"
:END:
A pager that wraps words at the 80th column, useful for [[https://github.com/michael-lazar/rtv][michael-lazar/rtv]].
#+begin_src sh
[ $# -ge 1 -a -f "$1" ] && input="$1" || input="-"
cat $input | fold -w 80 -s | less
#+end_src
** updates
:PROPERTIES:
:header-args+: :tangle ~/bin/updates :shebang "#!/usr/bin/env bash"
:END:
A script to update pip, apt, and homebrew packages.
*** Initialize
Make sure not in a virtualenv and track pyenv python version.
#+begin_src sh
if [ -n "$VIRTUAL_ENV" ]; then
    echo 'Exit virtualenv first'
elif [ -n "$PYTHONPATH" ]; then
    echo 'Not updating, PYTHONPATH is set.'
else
    # Track global python version
    eval "$(pyenv init -)"
    globalpython=$(echo $(pyenv version) | cut -d' ' -f1)
#+end_src
*** Python 2 pip
#+begin_src sh
# Update pip for python 2
pyenv global $python2version
echo -e "\e[1;34mUpdating: \e[91mpip2\e[0;97m"
IFS=$'\n'
echo  $'Getting outdated pip2 packages...'
res=$(pip list -o --format=legacy | sed 's/ .*//')

if [ -z "$res" ]; then
    echo $'All packages up to date.'
else
    echo $res | xargs pip install --upgrade
fi
pip freeze > ~/Dropbox\ \(MIT\)/installed-programs/pip2.txt
sed -i -e 's/=.*//' ~/Dropbox\ \(MIT\)/installed-programs/pip2.txt
#+end_src
*** Python 3 pip
#+begin_src sh
# Update pip for python 3
pyenv global $python3version
echo -e "\n\e[1;34mUpdating: \e[91mpip3\e[0;97m"
IFS=$'\n'
echo  $'Getting outdated pip3 packages...'
res=$(pip list -o --format=legacy | sed 's/ .*//')

if [ -z "$res" ]; then
    echo $'All packages up to date.'
else
    echo $res | xargs pip install --upgrade
fi
pip freeze > ~/Dropbox\ \(MIT\)/installed-programs/pip3.txt
sed -i -e 's/=.*//' ~/Dropbox\ \(MIT\)/installed-programs/pip3.txt
#+end_src
*** Package manager
**** Darwin
#+begin_src sh :tangle (when (eq system-type 'darwin) "~/bin/updates")
pyenv global system
echo -e "\n\e[1;34mUpdating: \e[91mHomebrew\e[0;97m"
brew update
brew upgrade
brew cleanup
brew prune
brew doctor

brew bundle dump --force --file=~/Dropbox\ \(MIT\)/installed-programs/brew.rb
#+end_src

**** Debian
#+begin_src sh :tangle (when (eq system-type 'gnu/linux) "~/bin/updates")
echo -e "\n\e[1;34mUpdating: \e[91mapt-get\e[0;97m"
sudo apt-get update
sudo apt-get upgrade

mkdir -p ~/Dropbox\ \(MIT\)/installed-programs/apt
dpkg --get-selections > ~/Dropbox\ \(MIT\)/installed-programs/apt/package.list
sudo cp -R /etc/apt/sources.list* ~/Dropbox\ \(MIT\)/installed-programs/apt/
sudo apt-key exportall > ~/Dropbox\ \(MIT\)/installed-programs/apt/repo.keys
#+end_src
*** Finalize
#+begin_src sh
echo " "
echo -e "\e[1;34mDone"

pyenv global $globalpython # Set python version back to original
fi
#+end_src
** wfname
:PROPERTIES:
:header-args+: :tangle (when (eq system-type 'darwin) "~/bin/wfname") :shebang "#!/usr/bin/env python"
:END:
Get the name of the current Alfred workflow (since last I checked Alfred
doesn't store workflows in directories with logical names).
#+begin_src python
from __future__ import print_function
import plistlib,sys

try:
    print('\nWorkflow: '+plistlib.readPlist('info.plist')['name'])
except IOError:
    print('No \'info. plist\' file. ')
#+end_src
